# 날짜 : 2021/09/30
# 이름 : 박승필
# 내용 : 고급 시각화분석 - 교재 예제 실습

#교재 p234 실습 - lattice 패키지 사용준비하기
install.packages('lattice')
library('lattice')

#교재 p236 실습 - histogram() 함수를 이용하여 데이터 시각화하기

#교재 p236 실습 - score 변수를 조건변수로 지정하여 데이터 시각화하기

#교재 p238 실습 - densityplot() 함수를 사용하여 밀도 그래프 그리기

#교재 p239 실습 - barchart() 함수를 사용하여 막대 그래프 그리기

#교재 p241 실습 - dotplot() 함수를 사용하여 점 그래프 그리기

#교재 p243 실습 - airquality 데이터셋으로 산점도 그래프 그리기

#교재 p246 실습 - quakes 데이터셋으로 산점도 그래프 그리기

#교재 p247 실습 - 이산형 변수를 조건으로 지정하여 산점도 그리기

#교재 p248 실습 - 동일한 패널에 두개의 변수값 표현하기

#교재 p249 실습 - equal.count() 함수를 사용하여 이산형 변수 범주화하기

#교재 p251 실습 - 수심과 리히터 규모 변수를 동시에 적용하여 산점도 그리기

#교재 p253 실습 - 이산형 변수를 리코딩한 뒤에 factor형으로 변환하여 산점도 그리기

#교재 p254 실습 - depth 조건에 의해서 위도와 경도의 조건 그래프 그리기

#교재 p255 실습 - 조건의 구간 크기와 겹침 간격 적용 후 조건 그래프 그리기

#교재 p256 실습 - 패널과 조건 막대에 색을 적용하여 조건 그래프 그리기

#교재 p257 실습 - 위도, 경도, 깊이를 이용하여 3차원 산점도 그리기

#교재 p258 실습 - 테두리와 회전 속성을 추가하여 3차원 산점도 그래프 그리기

#교재 p259 실습 - ggplot2 패키지 설치와 실습 데이터 가져오기

#교재 p261 실습 - qplot() 함수의 fill과 binwidth속성 적용하기

#교재 p262 실습 - facets 속성을 사용하여 drv 변수값으로 행/열 단위로 패널 생성하기

#교재 p263 실습 - qplot() 함수에서 color 속성을 사용하여 두 변수 구분하기

#교재 p264 실습 - displ과 hwy 변수의 관계를 drv 변수로 구분하기

#교재 p264 실습 - mtcars 데이터 셋에 색상, 크기, 모양 적용하기

#교재 p266 실습 - diamonds 데이터 셋에 막대, 점, 선 레이아웃 적용하기
